# Taps the 1Password CLI repository
tap "1password/tap"

# Taps the Homebrew Bundle repository
tap "homebrew/bundle"

# Taps the Homebrew Cask repository
tap "homebrew/cask"

# Taps the Homebrew Core repository
tap "homebrew/core"

# Installs Python 3.10
brew "python@3.10"

# Installs autojump, a tool for quick directory navigation
brew "autojump"

# Installs Docker, a platform for containerization
brew "docker"

# Installs duti, a utility for managing default applications
brew "duti"

# Installs fd, a fast alternative to 'find'
brew "fd"

# Installs fzf, a fuzzy finder for the command line
brew "fzf"

# Installs Git Large File Storage (LFS) extension
brew "git-lfs"

# Installs GNU Privacy Guard (GnuPG), a tool for encryption and signing
brew "gnupg"

# Installs Node.js, a JavaScript runtime
brew "node"

# Installs nvm, Node Version Manager for managing Node.js versions
brew "nvm"

# Installs pam-reattach, a PAM module for macOS to reattach to user sessions
brew "pam-reattach"

# Installs pinentry-mac, a tool for entering PIN or passphrase
brew "pinentry-mac"

# Installs pyenv, a Python version management tool
brew "pyenv"

# Installs Python 3.11
brew "python@3.11"

# Installs thefuck, a command-line tool for correcting previous commands
brew "thefuck"

# Installs wget, a command-line tool for downloading files
brew "wget"

# Installs yadm, a dotfile manager
brew "yadm"

# Installs Zsh, a popular shell
brew "zsh"

# Installs zsh-autosuggestions, a Zsh plugin for autosuggestions
brew "zsh-autosuggestions"

# Installs zsh-syntax-highlighting, a Zsh plugin for syntax highlighting
brew "zsh-syntax-highlighting"

# Install 1Password CLI
cask "1password-cli"

# Install Karabiner-Elements, a keyboard customizer
cask "karabiner-elements"

# Install VS Code extension for Cucumber autocomplete
vscode "alexkrechik.cucumberautocomplete"

# Install VS Code extension for sorting imports
vscode "amatiasq.sort-imports"

# Install VS Code extension for handling Zip archives
vscode "arcanis.vscode-zipfs"

# Install VS Code theme: Copilot Theme
vscode "benjaminbenais.copilot-theme"

# Install VS Code extension for source action menus in folders
vscode "bierner.folder-source-actions"

# Install VS Code extension for enhanced console logs
vscode "ChakrounAnas.turbo-console-log"

# Install VS Code extension for Firebase JSON files
vscode "damphat.firebase-json"

# Install VS Code extension for Markdown linting
vscode "DavidAnson.vscode-markdownlint"

# Install VS Code extension for ESLint integration
vscode "dbaeumer.vscode-eslint"

# Install VS Code extension for viewing Git history
vscode "donjayamanne.githistory"

# Install VS Code extension for XML editing
vscode "DotJoshJohnson.xml"

# Install Dracula theme for VS Code
vscode "dracula-theme.theme-dracula"

# Install GitLens extension for enhanced Git functionality
vscode "eamodio.gitlens"

# Install EditorConfig extension for VS Code
vscode "EditorConfig.EditorConfig"

# Install Prettier extension for VS Code
vscode "esbenp.prettier-vscode"

# Install VS Code extension for Yarn integration
vscode "gamunu.vscode-yarn"

# Install VS Code extension for HTML preview
vscode "george-alisson.html-preview-vscode"

# Install GitHub Copilot extension for VS Code
vscode "GitHub.copilot"

# Install VS Code extension for managing TODOs
vscode "Gruntfuggly.todo-tree"

# Install Jenkinsfile Support extension for VS Code
vscode "ivory-lab.jenkinsfile-support"

# Install Better Dockerfile Syntax extension for VS Code
vscode "jeff-hykin.better-dockerfile-syntax"

# Install VS Code extension for JSON5 support
vscode "KatjanaKosic.vscode-json5"

# Install VS Code extension for fixing checksums
vscode "lehni.vscode-fix-checksums"

# Install AWK extension for VS Code
vscode "luggage66.AWK"

# Install Rainbow CSV extension for VS Code
vscode "mechatroner.rainbow-csv"

# Install dotenv extension for VS Code
vscode "mikestead.dotenv"

# Install Docker extension for VS Code
vscode "ms-azuretools.vscode-docker"

# Install Playwright extension for VS Code
vscode "ms-playwright.playwright"

# Install Live Share extension for collaborative development
vscode "ms-vsliveshare.vsliveshare"

# Install Cucumber Step Definition Generator extension for VS Code
vscode "muralidharan92.cuke-step-definition-generator"

# Install Groovy Lint extension for VS Code
vscode "NicolasVuillamy.vscode-groovy-lint"

# Install Indent Rainbow extension for VS Code
vscode "oderwat.indent-rainbow"

# Install Version Lens extension for VS Code
vscode "pflannery.vscode-versionlens"

# Install Git File History extension for VS Code
vscode "pomber.git-file-history"

# Install XML extension for VS Code
vscode "redhat.vscode-xml"

# Install Spell Checker extension for VS Code
vscode "streetsidesoftware.code-spell-checker"

# Install German dictionary for Spell Checker extension
vscode "streetsidesoftware.code-spell-checker-german"

# Install Stylelint extension for VS Code
vscode "stylelint.vscode-stylelint"

# Install PDF extension for VS Code
vscode "tomoki1207.pdf"

# Install VS Code Icons extension for icons
vscode "vscode-icons-team.vscode-icons"

# Install Volar extension for Vue.js support
vscode "Vue.volar"

# Install Vuetify extension for VS Code
vscode "vuetifyjs.vuetify-vscode"

# Install Quokka extension for VS Code
vscode "WallabyJs.quokka-vscode"

# Install Todo Highlight extension for VS Code
vscode "wayou.vscode-todo-highlight"

# Install Pretty TypeScript Errors extension for VS Code
vscode "yoavbls.pretty-ts-errors"

# Install Markdown All in One extension for VS Code
vscode "yzhang.markdown-all-in-one"

# Install JSON Tools extension for VS Code
vscode "ZainChen.json"

# Install Grammarly extension for VS Code
vscode "znck.grammarly"
